# user_ids = [482910442, 559201994, 772103948]
# for user in user_ids:
#     if user == 559201994:
#         continue
#     print(f"Надсилаємо повідомлення на ID:, {user}")


prices = [150, 400, 250, 1200]

# 1. Створюємо змінну для збереження загальної суми
total_sum = 0

# 2. Пишемо цикл, який пройдеться по списку prices
for price in prices:
    # Додаємо поточну ціну до загальної суми
    total_sum = total_sum + price

# 3. Виводим фінальний результат (вже ПІСЛЯ циклу, без відступів!)
print(f"Загальна вартість кошика: {total_sum} грн.")
