# вік = 15
# є_в_vip_списку = True
# має_небезпечні_речі = True
#
# if має_небезпечні_речі == True:
#     print("Вхід суворо заборонено! Викликаю поліцію! 🚨")
# elif є_в_vip_списку == True:
#     print("Ласкаво просимо до VIP-зони! Проходьте без черги! ✨")
# elif вік >= 18:
#     print("Вхід дозволено. Гарного вечора! 🎟️")
# else:
#     print("Вибачте, вам ще немає 18 років. Доступ закрито. 🧑‍ด")


напрямок = "Phyton"
досвід_у_роках = 1
пройшов_тест = True

if пройшов_тест == False:
    print("Будь ласка, спочатку пройдіть базовий тест! 📝")
elif досвід_у_роках >= 3:
    print("Вам підійде курс 'Python Senior'! 🔥")
elif напрямок == "Python":
    print("Вам підійде курс 'Python з нуля'! 🐍")
else:
    print("(Ми підберемо інший курс, очікуйте на дзвінок менеджера! 📞")


# 1. Створюємо змінні з вашими даними
name = "Василь"        # підставте сюди своє ім'я
lerning = "Python"       # підставте своє хобі або мову, яку вчите
tasks_done = 5            # скільки задач уже розв'язали

# 2. Збираємо все в один красивий f-рядок
message = f"Привіт! Я {name}. Я зараз вивчаю {lerning} і вже зробив {tasks_done} завдань."

# 3. Виводимо результат на екран
print(message)


player_name = "Рейнджер"
gold_found = 150
old_balance = 350

message = f"Гравець {player_name} знайшов {gold_found} золотих монет! Тепер загальний баланс:{old_balance}"
print(message)